MyProject/src/Documents/Чек/Чек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Чек</name>
  <basedOn>Document.Заказ</basedOn>
  <registerRecords>AccumulationRegister.Выручка</registerRecords>
  <attributes>
    <name>СчетНачисления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетСписания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставЗаказа</name>
    <attributes>
      <name>ПозицияМеню</name>
      <type>
        <types>CatalogRef.Меню</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоПоПозицииМеню</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MyProject/src/Documents/Чек/Forms/Чек/Module.bsl
&НаКлиенте
Процедура СоставЗаказаЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СоставЗаказа.ТекущиеДанные;
	СтрокаТабличнойЧасти.ИтогоПоПозицииМеню = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
КонецПроцедуры

&НаКлиенте
Процедура СоставЗаказаКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СоставЗаказа.ТекущиеДанные;
	СтрокаТабличнойЧасти.ИтогоПоПозицииМеню = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	
КонецПроцедуры
